In [15]:
import csv

In [16]:
csvfile = open('database.csv','r')

In [17]:
reader = csv.reader(csvfile)

In [18]:
for row in reader:
    print(row)

['name', 'gender', 'occupation']
['Jack', 'Male', 'Designer']
['James', 'Male', 'Student']
['Alice', 'Female', 'Soldier']
['Bob', 'Male', 'Nurse']
['Jessica', 'Female', 'Banker']

**To install Pandas you need to open Terminal and type "pip3 install pandas"

In [19]:
import pandas as pd

a Dataframe represents a rectangular table of data and contains an ordered collection of columns

In [20]:
data_frame = pd.read_csv('database.csv')

In [21]:
data_frame

      name  gender occupation
0     Jack    Male   Designer
1    James    Male    Student
2    Alice  Female    Soldier
3      Bob    Male      Nurse
4  Jessica  Female     Banker

In [22]:
data_frame.columns # look for columns

Index(['name', 'gender', 'occupation'], dtype='object')

In [23]:
data_frame.info() # gives you details on the data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
name          5 non-null object
gender        5 non-null object
occupation    5 non-null object
dtypes: object(3)
memory usage: 200.0+ bytes

In [24]:
data_frame['name'] # call the "name" column

0       Jack
1      James
2      Alice
3        Bob
4    Jessica
Name: name, dtype: object

In [25]:
data_frame.ix[2] # Call the 3rd row (Python starts with zero)

name            Alice
gender         Female
occupation    Soldier
Name: 2, dtype: object

In [26]:
data_frame['school'] = "KCL" # adds new column "school"

In [27]:
data_frame

      name  gender occupation school
0     Jack    Male   Designer    KCL
1    James    Male    Student    KCL
2    Alice  Female    Soldier    KCL
3      Bob    Male      Nurse    KCL
4  Jessica  Female     Banker    KCL

In [28]:
data_frame.rename(columns={'occupation': 'job', "gender": "sex"}, inplace=True) # change column name "occupation" to "job"

In [29]:
data_frame

      name     sex       job school
0     Jack    Male  Designer    KCL
1    James    Male   Student    KCL
2    Alice  Female   Soldier    KCL
3      Bob    Male     Nurse    KCL
4  Jessica  Female    Banker    KCL

In [34]:
data_frame.drop([1, 2]) # drop 2nd and 3rd row

      name  gender       job school
0     Jack    Male  Designer    KCL
3      Bob    Male     Nurse    KCL
4  Jessica  Female    Banker    KCL

In [36]:
df= data_frame[data_frame.name != 'Jessica'] # drop if name is Jessica

In [37]:
df

    name  gender       job school
0   Jack    Male  Designer    KCL
1  James    Male   Student    KCL
2  Alice  Female   Soldier    KCL
3    Bob    Male     Nurse    KCL

In [38]:
data_frame.drop('school', axis=1) # drop column "school"

      name  gender       job
0     Jack    Male  Designer
1    James    Male   Student
2    Alice  Female   Soldier
3      Bob    Male     Nurse
4  Jessica  Female    Banker